spec/spec/SVWS/IntegrationPlatform/Examples/SetCardLimitRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:int="http://sv.bpc.in/SVIP">
    <soapenv:Header/>
    <soapenv:Body>
    <int:IFX>
        <AcctModRq>
            <RqUID>00000000-0000-0000-0000-000000000101</RqUID>
            <MsgRqHdr>
                <ContextRqHdr>
                    <NetworkTrnData>
                        <NetworkOwner>Branch</NetworkOwner>
                        <TerminalIdent>10000003</TerminalIdent>
                    </NetworkTrnData>
                    <ClientDt>2013-05-16T12:00:00</ClientDt>
                </ContextRqHdr>
            </MsgRqHdr>
            <AcctKeys>
                <CardKeys>
                    <CardNum>5123451129192874</CardNum>
                    <CardSeqNum>1</CardSeqNum>
                </CardKeys>
            </AcctKeys>
            <AcctInfo>
                <AcctBal>
                    <BalType>
                        <BalTypeValues>PurchDayLimit</BalTypeValues>
                    </BalType>
                    <CurAmt>
                        <Amt>400000</Amt>
                        <CurCode>
                            <CurCodeValue>USD</CurCodeValue>
                        </CurCode>
                    </CurAmt>
                </AcctBal>
            </AcctInfo>
            <UpdElements>AcctBal[BalType/BalTypeValues = "PurchDayLimit"]</UpdElements>
        </AcctModRq>
    </int:IFX>
    </soapenv:Body>
</soapenv:Envelope>        